Repository: Esukhia/Corpora
Catalog: Parallel/84000/UT22084-059-014.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པ་དག་བྱང་ཆུབ་ལ་བཀོད་ནས་ད་སྟེ་བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ན།
en: and having brought an innumerable, immeasurable, inconceivable number of sentient beings to enlightenment,

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཉིད་དུ།
en: in six million eight hundred thousand kalpas

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་མེ་ཏོག་བྱེད་ཅེས་བྱ་བར་འགྱུར་ཏེ།
en: she will become the Tathāgata, arhat, perfectly complete buddha named Bodhyaṅgapuṣpakara in this trichiliocosm.

source: ཀུན་དགའ་བོ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱོད་པ་ཇི་ལྟ་བ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་དེའི་སེམས་ཅན་རྣམས་ཀྱི་ལོངས་སྤྱོད་པ་དང་ཀུན་སྤྱོད་པ། དེ་ཡང་དེ་དང་འདྲ་བར་འགྱུར་རོ། །
en: Ānanda, the wealth and enjoyments of sentient beings of this buddha field will be like those of the gods of the Thirty-Three.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏེ།
en: Thus did the Bhagavān announce, and having spoken these words,

source: བདེ་བར་གཤེགས་པས་དེ་སྐད་གསུངས་ནས། སྟོན་པས་གཞན་ཡང་འདི་སྐད་བཀའ་སྩལ་ཏོ། །
en: the Sugata, the Teacher, added the following verses:
